---
type: DuctInsulationType
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 1
tags: [revit-api, class]
---

# DuctInsulationType

`Autodesk.Revit.DB.Mechanical.DuctInsulationType` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Parameter | — | `` |